In [1]:
%load_ext sql
import pandas as pd
import sqlite3

In [2]:
%sql sqlite:///CourseDataWarehouse.db
conn = sqlite3.connect('CourseDataWarehouse.db')

Which courses in 2017-2018 had data in the "Fee" field?

In [3]:
%%sql

SELECT Cat_ID, Amount, Academic_Year
FROM Fees1
WHERE Academic_Year IS '2017_2018'
LIMIT 25;

 * sqlite:///CourseDataWarehouse.db
Done.

[('BI 0107', '$55 Science Lab Fee', '2017_2018'),
 ('BI 0108', '$55 Science Lab Fee', '2017_2018'),
 ('SA 0011', '$55 Materials Fee', '2017_2018'),
 ('BI 0151', '$55 Science Lab Fee', '2017_2018'),
 ('SA 0012', '$55 Materials Fee', '2017_2018'),
 ('SA 0013', '$55 Materials Fee', '2017_2018'),
 ('SA 0014', '$55 Materials Fee', '2017_2018'),
 ('SA 0015', '$55 Materials Fee', '2017_2018'),
 ('SA 0016', '$55 Materials Fee', '2017_2018'),
 ('BI 0170', '$55 Science Lab Fee', '2017_2018'),
 ('BI 0171', '$55 Science Lab Fee', '2017_2018'),
 ('SA 0100', '$55 Materials Fee', '2017_2018'),
 ('SA 0101', '$55 Materials Fee', '2017_2018'),
 ('BI 0172', '$55 Science Lab Fee', '2017_2018'),
 ('SA 0105', '$55 Materials Fee', '2017_2018'),
 ('SA 0130', '$55 Materials Fee', '2017_2018'),
 ('SA 0132', '$55 Materials Fee', '2017_2018'),
 ('SA 0133', '$105 Materials Fee', '2017_2018'),
 ('SA 0134', '$105 Materials Fee', '2017_2018'),
 ('SA 0136', '$55 Materials Fee', '2017_2018'),
 ('SA 0137', '$55 Materials Fee', '2017_2018'),
 ('SA 0138', '$55 Materials Fee', '2017_2018'),
 ('SA 0139', '$55 Materials Fee', '2017_2018'),
 ('SA 0230', '$55 Materials Fee', '2017_2018'),
 ('SA 0231', '$55 Materials Fee', '2017_2018')]

Which classes (by title) are in which programs?

In [4]:
%%sql

SELECT Title, Program1.Program_Name
FROM Course_Facts
JOIN Program1 ON Course_Facts.PID = Program1.PID
GROUP BY Title
LIMIT 25;

 * sqlite:///CourseDataWarehouse.db
Done.

[('19th Century Romanticism in Music', 'Music'),
 ('19th-Century Russian Novel and World Literature', 'English'),
 ('20th Century British Literature', 'English'),
 ('20th Century Philosophy', 'Philosophy'),
 ('20th Century Russia', 'History'),
 ('20th Century Spanish Literature', 'Spanish'),
 ('20th Century United States', 'History'),
 ('21st Century Literacies in the Classroom', 'Educational Technology'),
 ('21st Century Power Politics', 'Politics'),
 ('Abnormal Psychology for Majors', 'Psychology'),
 ('Abnormal Psychology for Non-Majors', 'Psychology'),
 ('Abstract Algebra', 'Mathematics'),
 ('Accelerated Statistics', 'Mathematics'),
 ('Accounting Information Systems', 'Accounting'),
 ('Accounting Information Systems and Technology', 'Accounting'),
 ('Accounting Information for Decision-Making', 'Accounting'),
 ('Accounting for Governments, Hospitals, and Universities', 'Accounting'),
 ('Achieving an Interdisciplinary Approach to Teaching through Technology', 'Educational Technology'),
 ('Acting I', 'Theatre'),
 ('Acting II', 'Theatre'),
 ('Acting for the Camera', 'Film, Television, and Media Arts'),
 ('Actuarial Problem Solving', 'Mathematics'),
 ('Adult Health I', 'Nursing'),
 ('Adult Health II', 'Nursing'),
 ('Advanced Abstract Algebra', 'Mathematics')]

What rooms historically have large capacity classes?

In [5]:
%%sql

SELECT DISTINCT (Location.Room), Capacity
FROM Course_Facts
JOIN Location ON Course_Facts.LID = Location.LID
ORDER BY Capacity DESC
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('GNZ AUDI', 100),
 ('NHS 224', 93),
 ('NHS 224', 92),
 ('SON 203', 91),
 ('SON 203', 90),
 ('NHS 224', 88),
 ('NHS 224', 86),
 ('NHS 103/104', 86),
 ('NHS 103/104', 85),
 ('SON 203', 83)]

What class titles are in the Accounting Program?

In [6]:
%%sql

SELECT Title
FROM Course_Facts
JOIN Program1 ON Course_Facts.PID = Program1.PID
WHERE Program_Name IS 'Accounting'
GROUP BY Title
LIMIT 25;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Accounting Information Systems',),
 ('Accounting Information Systems and Technology',),
 ('Accounting Information for Decision-Making',),
 ('Accounting for Governments, Hospitals, and Universities',),
 ('Advanced Accounting',),
 ('Audit Issues in a Global Environment',),
 ('Auditing',),
 ('Cost Management',),
 ('Cost Management Lab',),
 ('Federal Income Taxation I',),
 ('Federal Income Taxation II',),
 ('Financial Statement Analysis',),
 ('Forensic Accounting',),
 ('Independent Study',),
 ('Individual Taxation: Socioeconomic Applications',),
 ('Intermediate Accounting I',),
 ('Intermediate Accounting II',),
 ('International Accounting',),
 ('Internship',),
 ('Introduction to Accounting',),
 ('Introduction to Financial Accounting',),
 ('Introduction to Management Accounting',),
 ('Issues in Accounting Ethics',),
 ('Issues in Internal Audit',),
 ('Issues in a Regulatory Reporting Environment',)]

In [7]:
%%sql
SELECT DISTINCT Prg_Code, Program_Name
FROM Course_Facts
    JOIN Program1 USING (PID)
LIMIT 20;

 * sqlite:///CourseDataWarehouse.db
Done.

[('AC', 'Accounting'),
 ('AS', 'American Studies'),
 ('AY', 'Anthropology'),
 ('AE', 'Applied Ethics'),
 ('AR', 'Arabic'),
 ('AH', 'Art History'),
 ('AN', 'Asian Studies'),
 ('BI', 'Biology'),
 ('BU', 'Business'),
 ('BB', 'Business'),
 ('CH', 'Chemistry'),
 ('CI', 'Chinese'),
 ('CL', 'Classical Studies'),
 ('CO', 'Communication'),
 ('CR', 'Computer Engineering'),
 ('CS', 'Computer Science'),
 ('CN', 'Counseling'),
 ('EC', 'Economics'),
 ('ED', 'Education'),
 ('MD', 'Educational Technology')]

In [8]:
%%sql
SELECT Room, COUNT(Room) as Num_Classes
FROM Location
    JOIN Course_Facts USING (LID)
WHERE Faculty_Name LIKE ("%Huntley%")
GROUP BY Room
ORDER BY Num_Classes DESC
LIMIT 100;

 * sqlite:///CourseDataWarehouse.db
Done.

[('DSB 106', 378),
 ('DSB 109', 371),
 ('DSB 110B', 358),
 ('DSB 114', 252),
 ('DSB 115', 237),
 ('DSB 108', 173),
 ('DSB 107', 163),
 ('DSB 110A', 117),
 ('DSB 104', 95),
 ('DSB 112', 95),
 ('DSB 111', 70),
 ('DSB 2109A', 62),
 ('DSB 105', 24)]